#include <stdio.h>
#include <stdlib.h>
#include <math.h>

main()
{
    int x, y, x1, y1, x2, y2;
    printf("прямоугольник задается диагональю x1;y1 -> x2;y2 \n");
    printf("введите начальную точку диагонали \n");
    scanf("%d",&x1);
    scanf("%d",&y1);
    printf("введите конечную точку диагонали \n");
    scanf("%d",&x2);
    scanf("%d",&y2);
    if ((x1==x2)||(y1==y2)) {printf("не корректно задана диагональ \n");}
    if ((x1>x2)||(y1>y2)) 
        {
            if (x1>x2) {x1=x1-x2; x2=x2+x1; x1=x2-x1;}
            if (y1>y2) {y1=y1-y2; y2=y2+y1; y1=y2-y1;}  

    printf("проверить точку \n");
    scanf("%d",&x);
    scanf("%d",&y);
    if ((x1<x)&&(x<x2)&&(y1<y)&&(y<y2)) {printf("точка лежит в прямоугольнике \n");}
    if ((x>x2)||(y>y2)) {printf("точка лежит за пределами прямоугольника \n");}
    if ((x1==x)||(x==x2)&&(y1==y)||(y==y2)) {printf("точка лежит на ребре прямоугольника \n");}
        }
    else
        { 
        if ((x1<x2)&&(y1<y2)) 
            {
    
        printf("проверить точку \n");
        scanf("%d",&x);
        scanf("%d",&y);
        if ((x1<x)&&(x<x2)&&(y1<y)&&(y<y2)) {printf("точка лежит в прямоугольнике \n");}
        if ((x>x2)||(y>y2)) {printf("точка лежит за пределами прямоугольника \n");}
        if ((x1==x)||(x==x2)&&(y1==y)||(y==y2)) {printf("точка лежит на ребре прямоугольника \n");}
        
            }
        }
    getchar();
    getchar();
}
