#include <stdio.h> 					//подключение библиотеки <> | "" 
#include <stdlib.h>					//

main() 								// точка входа в программу | главна¤ функци¤ программа

{									//тело программы

printf("Hello, World");	 			//функци¤ дл¤ вывода строки из библиотеки <stdio.h>

getchar();							//ќжидание ввода символа

}									//конец тела программы

//тип им¤ ;							//объ¤вление переменных
int a;
int a, b, c;						//~
int a=7;							//присваивание переменных
int a, b=0, c=5;					//~
// переменную можно объ¤вл¤ть в любом месте программы до первого использовани¤


